# Intermediate Level Queries Session 2
## Nested Single-Row Functions

For this session, I will be creating a series of 10 queries that will involve nesting single-row functions. These queries will be a combination of character, number, and date functions. Records will be retrieved from either the TRAINERS, EMPS, DEPTS, OR OCCUPATONS table. The number of records returned will also be filtered by using the WHERE clause. All columns will have aliases for enhanced presentation.

In [1]:
# Import the Python extension module that will allow access to an Oracle database
import cx_Oracle

# Enable SQL Magics to write SQL queries
%load_ext sql

# Connect to the Oracle database using the file path along with the username and passord
%sql oracle+cx_oracle://SYSTEM:password@localhost:1521/xe

'Connected: SYSTEM@xe'

## Query 1
Writing a query that returns a record with the following format:

'Big JOHNNY LAURANCE**** (if the first and last name is 30 characters or less fill in the right side of the name with the designated star simple to the right of the name) has been with the company for 575 weeks!' Must use the CONCAT function to concatenate the columns. Return only records where the last_name has the letter 'L' as the third to last character.

In [15]:
%%sql
SELECT CONCAT(CONCAT(CONCAT(RPAD(CONCAT(CONCAT(CONCAT('Big ', UPPER(first_name)), ' '), UPPER(last_name)), 30, '*'),
              ' has been with the company for '), ROUND(((SYSDATE - hire_date) /7))), ' weeks!') "Number of Weeks"
FROM EMPS
WHERE last_name LIKE '%l__'

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('Big VALLI PATABALLA*********** has been with the company for 784 weeks!',),
 ('Big JAMES MARLOW************** has been with the company for 835 weeks!',),
 ('Big JASON MALLIN************** has been with the company for 870 weeks!',),
 ('Big STEPHEN STILES************ has been with the company for 799 weeks!',),
 ('Big PATRICK SULLY************* has been with the company for 885 weeks!',),
 ('Big JONATHON TAYLOR*********** has been with the company for 777 weeks!',),
 ('Big WINSTON TAYLOR************ has been with the company for 786 weeks!',),
 ('Big JENNIFER DILLY************ has been with the company for 809 weeks!',),
 ('Big ALANA WALSH*************** has been with the company for 773 weeks!',),
 ('Big JENNIFER WHALEN*********** has been with the company for 909 weeks!',)]

## Query 2
Writing a query that involves using a series of nested single-row functions to create an employer password. The goal for writing this query is to return one column consisting of the last and first name with a comma between the names. The full name needs to be in upper case. For the second column, the second through fourth characters will be selected from the first name with the first character being capitalized. This will be concatenated with the fifth from last to the second to last character in the last name being selected and in upper case and if the person's selected substring from the last name has the letter a, replace it with the star symbol. Return records where the second letter in the last name is an 'h', 'l', 'r' 's', or 't'.

Must use the concatenation function not the double pipe symbol.  
The output should look like this:
KOCHHAR, NEENA (first column), EenCHH* (second column)

In [46]:
%%sql
SELECT CONCAT(CONCAT(UPPER(last_name), ', '), UPPER(first_name)) "Employee Name",
CONCAT(INITCAP(SUBSTR(first_name, 2, 3)),UPPER(REPLACE(SUBSTR(last_name, -5, 4), 'a', '*'))) "Employee Passcode"
FROM EMPS
WHERE last_name LIKE '_h%' OR last_name LIKE '_l%' OR last_name LIKE '_r%' OR last_name LIKE '_s%' OR last_name LIKE '_t%'
ORDER BY last_name

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('ATKINSON, MOZHE', 'OzhINSO'),
 ('BLOOM, HARRISON', 'ArrBLOO'),
 ('CHEN, JOHN', 'Ohn'),
 ('CHUNG, KELLY', 'EllCHUN'),
 ('ERNST, BRUCE', 'RucERNS'),
 ('ERRAZURIZ, ALBERTO', 'LbeZURI'),
 ('FLEAUR, JEAN', 'EanLE*U'),
 ('FRIPP, ADAM', 'DamFRIP'),
 ('GRANT, KIMBERELY', 'ImbGR*N'),
 ('GRANT, DOUGLAS', 'OugGR*N'),
 ('GREENBERG, NANCY', 'AncNBER'),
 ('GREENE, DANIELLE', 'AniREEN'),
 ('KHOO, ALEXANDER', 'Lex'),
 ('OLSEN, CHRISTOPHER', 'HriOLSE'),
 ('OLSON, TJ', 'JOLSO'),
 ('PHILTANKER, HAZEL', 'Aze*NKE'),
 ('STILES, STEPHEN', 'TepTILE'),
 ('URMAN, JOSE MANUEL', 'OseURM*'),
 ('WHALEN, JENNIFER', 'EnnH*LE'),
 ('ZLOTKEY, ELENI', 'LenOTKE')]

## Query 3

 I will expand on the query above by using a CASE statement to assign a secondary passcode choice to employees with a last name that is less than 5 characters long. Since a five-character passcode would probably be more secure than a three-character password, I decided to make it so that the secondary passcode has five characters. If the employee's job ID starts with AC or AD, then '11' will added. If the employee's job ID starts with FI or HR, then '22' will be added. If the employee's job ID starts with IT or MK, then '33' will be added. If the job ID starts with PR or PU, then '44' will be added. For all job IDs that start with the letter S, the employee's secondary passcode will end with '55'.

In [28]:
%%sql
SELECT DISTINCT job_id "Job ID"
FROM emps
ORDER BY 1

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('AC_ACCOUNT',),
 ('AC_MGR',),
 ('AD_ASST',),
 ('AD_PRES',),
 ('AD_VP',),
 ('FI_ACCOUNT',),
 ('FI_MGR',),
 ('HR_REP',),
 ('IT_PROG',),
 ('MK_MAN',),
 ('MK_REP',),
 ('PR_REP',),
 ('PU_CLERK',),
 ('PU_MAN',),
 ('SA_MAN',),
 ('SA_REP',),
 ('SH_CLERK',),
 ('ST_CLERK',),
 ('ST_MAN',)]

In [25]:
%%sql
SELECT CONCAT(CONCAT(UPPER(last_name), ', '), UPPER(first_name)) "Employee Name", job_id "Job ID",
CONCAT(INITCAP(SUBSTR(first_name, 2, 3)),UPPER(REPLACE(SUBSTR(last_name, -5, 4), 'a', '*'))) "Employee Passcode",
CASE
    WHEN LENGTH(last_name) < 5 AND (job_id LIKE 'AC/_%' escape '/' OR job_id LIKE 'AD/_%' escape '/') THEN
    RPAD(CONCAT(INITCAP(SUBSTR(first_name, 2, 3)),UPPER(REPLACE(SUBSTR(last_name, -5, 4), 'a', '*'))), 5, '11')
    WHEN LENGTH(last_name) < 5 AND (job_id LIKE 'FI/_%' escape '/' OR job_id LIKE 'HR/_%' escape '/') THEN
    RPAD(CONCAT(INITCAP(SUBSTR(first_name, 2, 3)),UPPER(REPLACE(SUBSTR(last_name, -5, 4), 'a', '*'))), 5, '22')
    WHEN LENGTH(last_name) < 5 AND (job_id LIKE 'IT/_%' escape '/' OR job_id LIKE 'MK/_%' escape '/') THEN
    RPAD(CONCAT(INITCAP(SUBSTR(first_name, 2, 3)),UPPER(REPLACE(SUBSTR(last_name, -5, 4), 'a', '*'))), 5, '33')
    WHEN LENGTH(last_name) < 5 AND (job_id LIKE 'PR/_%' escape '/' OR job_id LIKE 'PU/_%' escape '/') THEN
    RPAD(CONCAT(INITCAP(SUBSTR(first_name, 2, 3)),UPPER(REPLACE(SUBSTR(last_name, -5, 4), 'a', '*'))), 5, '44')
    WHEN LENGTH(last_name) < 5 AND job_id LIKE 'S_/_%' escape '/' THEN
    RPAD(CONCAT(INITCAP(SUBSTR(first_name, 2, 3)),UPPER(REPLACE(SUBSTR(last_name, -5, 4), 'a', '*'))), 5, '55')
    END AS "Secondary Employee Passcode"
FROM EMPS
WHERE LENGTH(last_name) < 5
ORDER BY "Secondary Employee Passcode"

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('KING, JANETTE', 'SA_REP', 'Ane', 'Ane55'),
 ('BELL, SARAH', 'SH_CLERK', 'Ara', 'Ara55'),
 ('FAY, PAT', 'MK_REP', 'At', 'At333'),
 ('LEE, DAVID', 'SA_REP', 'Avi', 'Avi55'),
 ('FOX, TAYLER', 'SA_REP', 'Ayl', 'Ayl55'),
 ('BAER, HERMANN', 'PR_REP', 'Erm', 'Erm44'),
 ('HALL, PETER', 'SA_REP', 'Ete', 'Ete55'),
 ('GEE, KI', 'ST_CLERK', 'I', 'I5555'),
 ('OZER, LISA', 'SA_REP', 'Isa', 'Isa55'),
 ('KHOO, ALEXANDER', 'PU_CLERK', 'Lex', 'Lex44'),
 ('BULL, ALEXIS', 'SH_CLERK', 'Lex', 'Lex55'),
 ('ABEL, ELLEN', 'SA_REP', 'Lle', 'Lle55'),
 ('CHEN, JOHN', 'FI_ACCOUNT', 'Ohn', 'Ohn22'),
 ('SEO, JOHN', 'ST_CLERK', 'Ohn', 'Ohn55'),
 ('RAJS, TRENNA', 'ST_CLERK', 'Ren', 'Ren55'),
 ('KING, STEVEN', 'AD_PRES', 'Tev', 'Tev11'),
 ('POPP, LUIS', 'FI_ACCOUNT', 'Uis', 'Uis22'),
 ('ANDE, SUNDAR', 'SA_REP', 'Und', 'Und55')]

In [31]:
%%sql
-- Checking to see that the number of employees with a last name with less than 5 characters is 18
SELECT COUNT(*)
FROM emps
WHERE LENGTH(last_name) < 5

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[(18,)]

## Query 4

 Writing a query that returns the records with the following format:

King, S was hired in JUNE-2003 and had a six-month review in DECEMBER-2003.

The CONCAT() function will be used instead of the double vertical bars.

In [26]:
%%sql
SELECT CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(last_name, ', '), SUBSTR(first_name, 1, 1)), ' was hired in '), 
              TO_CHAR(hire_date, 'MONTH-YYYY')), ' and had a six-month review in '),
               TO_CHAR(ADD_MONTHS(hire_date, 6), 'MONTH-YYYY')), '.') "Six-Month Review Date"
FROM emps
-- I will select only records where the third letter in the last name is an 's'
WHERE last_name LIKE '__s%'

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('Austin, D was hired in JUNE     -2005 and had a six-month review in DECEMBER -2005.',),
 ('Bissot, L was hired in AUGUST   -2005 and had a six-month review in FEBRUARY -2006.',),
 ('Olson, T was hired in APRIL    -2007 and had a six-month review in OCTOBER  -2007.',),
 ('Russell, J was hired in OCTOBER  -2004 and had a six-month review in APRIL    -2005.',),
 ('Olsen, C was hired in MARCH    -2006 and had a six-month review in SEPTEMBER-2006.',),
 ('Vishney, C was hired in NOVEMBER -2005 and had a six-month review in MAY      -2006.',)]

 ## Query 5

For this query, I will be using both the TRAINERS and OCCUPATIONS tables. The objective is to write out a query that will print out a statement in this format:

Ben. S is a general manager and has a yearly salary of $91,212! I will use the CONCAT() function instead of the double vertical bars. Include all records. If the employee does not have a job_title, then list them as a volunteer. If the job title is owner, then return 'an owner' not 'a owner'. For columns with null values, replace the value with 0 with the dollar symbol in front.

In [13]:
%%sql
SELECT CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(first_name, '.'), ' '), SUBSTR(last_name, 1, 1)), ' is a '), 
              NVL(Lower(job_title), 'volunteer')), ' and has a yearly salary of '),
              NVL(TO_CHAR(salary * 12, 'L999G999'),'$0')), '!') "Staff Information"
FROM trainers t
FULL OUTER JOIN occupations o
ON t.job_id = o.job_id
ORDER BY salary DESC NULLS LAST

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('Courtney. Q is a owner and has a yearly salary of           $129,600!',),
 ('Jason. K is a owner and has a yearly salary of           $126,000!',),
 ('Doug. R is a it manager and has a yearly salary of           $120,000!',),
 ('Linsdey. T is a dba and has a yearly salary of           $109,200!',),
 ('Hanna. W is a software engineer and has a yearly salary of           $106,800!',),
 ('Nathan. S is a software engineer and has a yearly salary of           $106,800!',),
 ('Sandra. D is a analyst and has a yearly salary of            $98,400!',),
 ('Laura. L is a analyst and has a yearly salary of            $92,400!',),
 ('Ben. S is a general manager and has a yearly salary of            $91,212!',),
 ('Drew. S is a facilities manager and has a yearly salary of            $90,000!',),
 ('Vanessa. W is a fitness manager and has a yearly salary of            $85,200!',),
 ('Kirk. M is a personal trainer and has a yearly salary of            $82,800!',),
 ('Vi. J is a sales manager and has a yearly salary of            $81,612!',),
 ('Robert. F is a personal trainer and has a yearly salary of            $68,400!',),
 ('Debbie. T is a personal trainer and has a yearly salary of            $66,000!',),
 ('Dave. H is a sales associate and has a yearly salary of            $56,400!',),
 ('Leslie. S is a personal trainer and has a yearly salary of            $55,200!',),
 ('Jerry. S is a personal trainer and has a yearly salary of            $52,812!',),
 ('Steven. J is a personal trainer and has a yearly salary of            $52,800!',),
 ('Wayne. C is a sales associate and has a yearly salary of            $52,800!',),
 ('Steven. H is a sales associate and has a yearly salary of            $49,200!',),
 ('Zach. D is a maintenance and has a yearly salary of            $46,800!',),
 ('Peter. D is a maintenance and has a yearly salary of            $45,600!',),
 ('Sarah. P is a sales associate and has a yearly salary of            $39,600!',),
 ('Hunter. F is a clerk and has a yearly salary of            $32,400!',),
 ('Howard. L is a janitor and has a yearly salary of            $31,200!',),
 ('Tucker. P is a janitor and has a yearly salary of            $30,000!',),
 ('Wesley. C is a clerk and has a yearly salary of            $29,400!',),
 ('Lamar. M is a janitor and has a yearly salary of            $29,400!',),
 ('Beth. W is a clerk and has a yearly salary of            $27,600!',),
 ('Seth. M is a clerk and has a yearly salary of            $27,600!',),
 ('Logan. G is a clerk and has a yearly salary of            $24,000!',),
 ('Donnelly. M is a personal trainer and has a yearly salary of             $6,000!',),
 ('Byron. H is a personal trainer and has a yearly salary of             $1,800!',),
 ('Jennifer. D is a volunteer and has a yearly salary of $0!',)]

In [15]:
%%sql
-- Using a case statement to fix grammer 'an analyst', not 'a analyst'
SELECT case
WHEN job_title IN('OWNER', 'IT MANAGER', 'ANALYST') THEN
CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(first_name, '.'), ' '), SUBSTR(last_name, 1, 1)), ' is an '), 
              NVL(Lower(job_title), 'volunteer')), ' and has a yearly salary of '),
              NVL(TO_CHAR(salary * 12, 'L999G999'), '$0')), '!') 
ELSE 
CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(first_name, '.'), ' '), SUBSTR(last_name, 1, 1)), ' is a '), 
              NVL(Lower(job_title), 'volunteer')), ' and has a yearly salary of '),
              NVL(TO_CHAR(salary * 12, 'L999G999'), '$0')), '!')
END AS "Staff Information"
FROM trainers t
FULL OUTER JOIN occupations o
ON t.job_id = o.job_id 
ORDER BY salary DESC NULLS LAST

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('Courtney. Q is an owner and has a yearly salary of           $129,600!',),
 ('Jason. K is an owner and has a yearly salary of           $126,000!',),
 ('Doug. R is an it manager and has a yearly salary of           $120,000!',),
 ('Linsdey. T is a dba and has a yearly salary of           $109,200!',),
 ('Hanna. W is a software engineer and has a yearly salary of           $106,800!',),
 ('Nathan. S is a software engineer and has a yearly salary of           $106,800!',),
 ('Sandra. D is an analyst and has a yearly salary of            $98,400!',),
 ('Laura. L is an analyst and has a yearly salary of            $92,400!',),
 ('Ben. S is a general manager and has a yearly salary of            $91,212!',),
 ('Drew. S is a facilities manager and has a yearly salary of            $90,000!',),
 ('Vanessa. W is a fitness manager and has a yearly salary of            $85,200!',),
 ('Kirk. M is a personal trainer and has a yearly salary of            $82,800!',),
 ('Vi. J is a sales manager and has a yearly salary of            $81,612!',),
 ('Robert. F is a personal trainer and has a yearly salary of            $68,400!',),
 ('Debbie. T is a personal trainer and has a yearly salary of            $66,000!',),
 ('Dave. H is a sales associate and has a yearly salary of            $56,400!',),
 ('Leslie. S is a personal trainer and has a yearly salary of            $55,200!',),
 ('Jerry. S is a personal trainer and has a yearly salary of            $52,812!',),
 ('Steven. J is a personal trainer and has a yearly salary of            $52,800!',),
 ('Wayne. C is a sales associate and has a yearly salary of            $52,800!',),
 ('Steven. H is a sales associate and has a yearly salary of            $49,200!',),
 ('Zach. D is a maintenance and has a yearly salary of            $46,800!',),
 ('Peter. D is a maintenance and has a yearly salary of            $45,600!',),
 ('Sarah. P is a sales associate and has a yearly salary of            $39,600!',),
 ('Hunter. F is a clerk and has a yearly salary of            $32,400!',),
 ('Howard. L is a janitor and has a yearly salary of            $31,200!',),
 ('Tucker. P is a janitor and has a yearly salary of            $30,000!',),
 ('Wesley. C is a clerk and has a yearly salary of            $29,400!',),
 ('Lamar. M is a janitor and has a yearly salary of            $29,400!',),
 ('Beth. W is a clerk and has a yearly salary of            $27,600!',),
 ('Seth. M is a clerk and has a yearly salary of            $27,600!',),
 ('Logan. G is a clerk and has a yearly salary of            $24,000!',),
 ('Donnelly. M is a personal trainer and has a yearly salary of             $6,000!',),
 ('Byron. H is a personal trainer and has a yearly salary of             $1,800!',),
 ('Jennifer. D is a volunteer and has a yearly salary of $0!',)]

## Query 6
Using the TRAINERS table, a query will return the following columns:
* Name: KING. J
* commission percentage, 0% for those with no commission,
* Bonus eligibility: Bonus or No Bonus,
* Bonus amount: 100, 300, 500, 1000 dollars depending on commission rate, lower commission rate gets higher bonus as an incentive to retain employees 
* Date of Bonus: Will be 3 months from the hire date with a date format similar to 5th of March, 2021. 

All records with the five columns will be printed in descending order based on Bonus amount.

In [46]:
%%sql 
SELECT CONCAT(CONCAT(UPPER(last_name), '. '), SUBSTR(first_name, 1, 1)) "Name",
CONCAT(NVL((commission_rate * 100), 0),'%') "Commission percentage",
NVL2(commission_rate, 'Bonus', 'No Bonus') "Bonus eligibility",
CASE  
    WHEN commission_rate >= 0.4 THEN '$100'
    WHEN commission_rate >= 0.3 THEN '$300'
    WHEN commission_rate >= 0.2 THEN '$500'
    WHEN commission_rate > 0.0 THEN '$1000'
    ELSE '$0'
END AS "Bonus Amount",
TO_CHAR(ADD_MONTHS(hire_date, 3), 'ddth "of" Month, YYYY') "Date of Bonus"
FROM trainers

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('KING. J', '0%', 'No Bonus', '$0', '13th of April    , 2021'),
 ('SCHROADER. B', '0%', 'No Bonus', '$0', '13th of April    , 2021'),
 ('PINES. S', '18%', 'Bonus', '$1000', '13th of April    , 2021'),
 ('SIEBRACE. L', '30%', 'Bonus', '$300', '13th of April    , 2021'),
 ('SIMPSON. J', '30%', 'Bonus', '$300', '13th of April    , 2021'),
 ('FROST. R', '30%', 'Bonus', '$300', '13th of April    , 2021'),
 ('JACOBSON. V', '10%', 'Bonus', '$1000', '13th of April    , 2021'),
 ('JACOBSON. S', '30%', 'Bonus', '$300', '13th of April    , 2021'),
 ('WILLIAMS. V', '40%', 'Bonus', '$100', '13th of April    , 2021'),
 ('MOORE. K', '30%', 'Bonus', '$300', '13th of April    , 2021'),
 ('DUNN. J', '0%', 'No Bonus', '$0', '13th of April    , 2021'),
 ('CAROLSON. W', '18%', 'Bonus', '$1000', '13th of April    , 2021'),
 ('MORRISON. S', '0%', 'No Bonus', '$0', '13th of April    , 2021'),
 ('WATKINS. B', '0%', 'No Bonus', '$0', '13th of April    , 2021'),
 ('QUEEN. C', '0%', 'No Bonus', '$0', '13th of April    , 2021'),
 ('ROBERTS. D', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('SMILEY. D', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('DOWNS. S', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('DEJOUNG. Z', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('TUCKER. L', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('PETERSON. T', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('HILL. D', '13%', 'Bonus', '$1000', '26th of April    , 2021'),
 ('TANG. D', '37%', 'Bonus', '$300', '26th of April    , 2021'),
 ('FABEL. H', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('DONNELLY. P', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('HANSON. S', '14%', 'Bonus', '$1000', '26th of April    , 2021'),
 ('STOKES. N', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('GARO. L', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('MADROVICH. L', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('LEDLOW. L', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('MILLER. D', '27%', 'Bonus', '$500', '26th of April    , 2021'),
 ('HOWARD. B', '24%', 'Bonus', '$500', '26th of April    , 2021'),
 ('WHITE. H', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('CORRALES. W', '0%', 'No Bonus', '$0', '26th of April    , 2021'),
 ('LOWELSKI. H', '0%', 'No Bonus', '$0', '26th of April    , 2021')]

## Query 7
Using the EMPS and DEPTS tables, a query will be written to return all employees who work in the IT department.
The query will return each record with a statement in the following format:

DAVID, A. works in the Information Technology department as an SQL developer.

This query will also retrieve records from the HR.JOBS table.

In [65]:
%%sql
SELECT CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(UPPER(first_name), ', '), SUBSTR(last_name, 1, 1)), '.'),
              ' works in the '), replace(d.department_name, 'IT', 'Informatin Technology ')),
                ' department as an '), replace(j.job_title, 'Programmer', 'SQL developer')), '.') "Employee's Job Role"
FROM emps e
JOIN depts d
ON e.department_id = d.department_id
JOIN hr.jobs j
ON e.job_id = j.job_id
WHERE d.department_name = 'IT'

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('ALEXANDER, H. works in the Informatin Technology  department as an SQL developer.',),
 ('BRUCE, E. works in the Informatin Technology  department as an SQL developer.',),
 ('DAVID, A. works in the Informatin Technology  department as an SQL developer.',),
 ('VALLI, P. works in the Informatin Technology  department as an SQL developer.',),
 ('DIANA, L. works in the Informatin Technology  department as an SQL developer.',)]

In [68]:
%%sql
-- Checking to see that I got all the employees who in the IT department
SELECT first_name, last_name, job_id
FROM emps
WHERE department_id = 60

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('Alexander', 'Hunold', 'IT_PROG'),
 ('Bruce', 'Ernst', 'IT_PROG'),
 ('David', 'Austin', 'IT_PROG'),
 ('Valli', 'Pataballa', 'IT_PROG'),
 ('Diana', 'Lorentz', 'IT_PROG')]

 ## Query 8
This query probably does not have any practical use in this scenario, but it will involve using the NULLIF and Length functions. I will be determining if the length of the first and last name combined multiplied by three is equal to the employee's age. 

The NULLIF function is used to compare values and check for equality between the values. An example in a library setting may be to see if the number of books that were scheduled to be checked in for a given day equals the number of books that were checked in. This would determine the number of books that are late, have not been checked in, or are missing.

In [33]:
%%sql
-- Not including the space if writing out the person's first and last name
SELECT first_name "First Name", last_name "Last Name", age "Age", LENGTH(first_name) "Length of First Name", 
LENGTH(last_name) "Length of Last Name", LENGTH(CONCAT(first_name, last_name)) "Length of Full Name",
LENGTH(CONCAT(first_name, last_name)) * 3 "Name Length x 3", NULLIF((LENGTH(CONCAT(first_name, last_name)) * 3), age) "Result"
FROM trainers
-- NULL values in the Result column indicate the values compared are equal.
-- Values that are not equal will have the value of the first argument placed into the NULLIF function displayed.

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('Jason', 'King', 41, 5, 4, 9, 27, 27),
 ('Ben', 'Schroader', 37, 3, 9, 12, 36, 36),
 ('Sarah', 'Pines', 31, 5, 5, 10, 30, 30),
 ('Leslie', 'Siebrace', 31, 6, 8, 14, 42, 42),
 ('Jerry', 'Simpson', 34, 5, 7, 12, 36, 36),
 ('Robert', 'Frost', 47, 6, 5, 11, 33, 33),
 ('Vi', 'Jacobson', 47, 2, 8, 10, 30, 30),
 ('Steven', 'Jacobson', 44, 6, 8, 14, 42, 42),
 ('Vanessa', 'Williams', 40, 7, 8, 15, 45, 45),
 ('Kirk', 'Moore', None, 4, 5, 9, 27, 27),
 ('Jennifer', 'Dunn', 37, 8, 4, 12, 36, 36),
 ('Wayne', 'Carolson', 39, 5, 8, 13, 39, None),
 ('Seth', 'Morrison', None, 4, 8, 12, 36, 36),
 ('Beth', 'Watkins', 28, 4, 7, 11, 33, 33),
 ('Courtney', 'Queen', 39, 8, 5, 13, 39, None),
 ('Doug', 'Roberts', 38, 4, 7, 11, 33, 33),
 ('Drew', 'Smiley', 48, 4, 6, 10, 30, 30),
 ('Sandra', 'Downs', 37, 6, 5, 11, 33, 33),
 ('Zach', 'DeJoung', 45, 4, 7, 11, 33, 33),
 ('Linsdey', 'Tucker', 40, 7, 6, 13, 39, 39),
 ('Tucker', 'Peterson', 29, 6, 8, 14, 42, 42),
 ('Dave', 'Hill', 37, 4, 4, 8, 24, 24),
 ('Debbie', 'Tang', 31, 6, 4, 10, 30, 30),
 ('Hunter', 'Fabel', 20, 6, 5, 11, 33, 33),
 ('Peter', 'Donnelly', 34, 5, 8, 13, 39, 39),
 ('Steven', 'Hanson', 48, 6, 6, 12, 36, 36),
 ('Nathan', 'Stokes', 27, 6, 6, 12, 36, 36),
 ('Logan', 'Garo', 20, 5, 4, 9, 27, 27),
 ('Lamar', 'Madrovich', 39, 5, 9, 14, 42, 42),
 ('Laura', 'Ledlow', 41, 5, 6, 11, 33, 33),
 ('Donnelly', 'Miller', 46, 8, 6, 14, 42, 42),
 ('Byron', 'Howard', 28, 5, 6, 11, 33, 33),
 ('Hanna', 'White', 44, 5, 5, 10, 30, 30),
 ('Wesley', 'Corrales', 29, 6, 8, 14, 42, 42),
 ('Howard', 'Lowelski', 29, 6, 8, 14, 42, 42)]

## Query 9
Using the emps table. A query will be written in the following format:

DONNELLY MI was hired back on the 18th of April in 2005 with '*' padded on both sides of the statement.
Only records where the hire_date was in either 2004 or 2005 will be selected.

In [92]:
%%sql
SELECT LPAD(RPAD(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(UPPER(first_name), ' '), SUBSTR(UPPER(last_name), 1, 2)), 
              ' was hired back on '), TO_CHAR(hire_date, ' "the" ddth "of" Month "in" YYYY')), '.'),
           64, '*'), 69, '*') "Hire Date"
FROM emps
WHERE hire_date BETWEEN '01-JAN-04' AND '31-DEC-05'
ORDER BY hire_date DESC

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('*****SHELLI BA was hired back on  the 24th of December  in 2005.*****',),
 ('*****LOUISE DO was hired back on  the 15th of December  in 2005.*****',),
 ('*****CLARA VI was hired back on  the 11th of November  in 2005.******',),
 ('*****MOZHE AT was hired back on  the 30th of October   in 2005.******',),
 ('*****STEPHEN ST was hired back on  the 26th of October   in 2005.****',),
 ('*****SHANTA VO was hired back on  the 10th of October   in 2005.*****',),
 ('*****ISMAEL SC was hired back on  the 30th of September in 2005.*****',),
 ('*****JOHN CH was hired back on  the 28th of September in 2005.*******',),
 ('*****NEENA KO was hired back on  the 21st of September in 2005.******',),
 ('*****PETER HA was hired back on  the 20th of August    in 2005.******',),
 ('*****LAURA BI was hired back on  the 20th of August    in 2005.******',),
 ('*****PAT FA was hired back on  the 17th of August    in 2005.********',),
 ('*****JENNIFER DI was hired back on  the 13th of August    in 2005.***',),
 ('*****SIGAL TO was hired back on  the 24th of July      in 2005.******',),
 ('*****JULIA NA was hired back on  the 16th of July      in 2005.******',),
 ('*****DAVID AU was hired back on  the 25th of June      in 2005.******',),
 ('*****KELLY CH was hired back on  the 14th of June      in 2005.******',),
 ('*****ADAM FR was hired back on  the 10th of April     in 2005.*******',),
 ('*****DAVID BE was hired back on  the 24th of March     in 2005.******',),
 ('*****ALYSSA HU was hired back on  the 19th of March     in 2005.*****',),
 ('*****LISA OZ was hired back on  the 11th of March     in 2005.*******',),
 ('*****LINDSEY SM was hired back on  the 10th of March     in 2005.****',),
 ('*****ALBERTO ER was hired back on  the 10th of March     in 2005.****',),
 ('*****BRITNEY EV was hired back on  the 03rd of March     in 2005.****',),
 ('*****ALEXIS BU was hired back on  the 20th of February  in 2005.*****',),
 ('*****JAMES MA was hired back on  the 16th of February  in 2005.******',),
 ('*****PETER TU was hired back on  the 30th of January   in 2005.******',),
 ('*****CURTIS DA was hired back on  the 29th of January   in 2005.*****',),
 ('*****KAREN PA was hired back on  the 05th of January   in 2005.******',),
 ('*****JOHN RU was hired back on  the 01st of October   in 2004.*******',),
 ('*****ALLAN MC was hired back on  the 01st of August    in 2004.******',),
 ('*****MATTHEW WE was hired back on  the 18th of July      in 2004.****',),
 ('*****JASON MA was hired back on  the 14th of June      in 2004.******',),
 ('*****ELLEN AB was hired back on  the 11th of May       in 2004.******',),
 ('*****PATRICK SU was hired back on  the 04th of March     in 2004.****',),
 ('*****MICHAEL HA was hired back on  the 17th of February  in 2004.****',),
 ('*****SARAH BE was hired back on  the 04th of February  in 2004.******',),
 ('*****JANETTE KI was hired back on  the 30th of January   in 2004.****',),
 ('*****NANDITA SA was hired back on  the 27th of January   in 2004.****',)]

In [98]:
%%sql
-- Figuring the average length of the above statement without the '*' padded in.
-- Varying statement lengths will make it challenging to have padded '*' that look close to even on both sides
SELECT ROUND(AVG(LENGTH(CONCAT(CONCAT(CONCAT(CONCAT(CONCAT(UPPER(first_name), ' '), SUBSTR(UPPER(last_name), 1, 2)), 
              ' was hired back on '), TO_CHAR(hire_date, ' "the" ddth "of" MONTH "in" YYYY')), '.')))) "Statement Length"
FROM emps
WHERE hire_date BETWEEN '01-JAN-04' AND '31-DEC-05'

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[(59,)]

## Query 10
This query may not be the most practical, but it helps to reinforce using the different single-row functions and then nesting these functions. 
For this last query, I will be using the TRAINERS table to create a statement with the following format: 
* Jerry SIMPSON is in his 30s!

The statement will consider whether the gender is male or female 'his/her' age group.
For first names that contain the letter a, the letter will be replaced with five '*' characters.

In [52]:
%%sql
SELECT CASE
    WHEN TRUNC(age, -1) = 20 AND gender = 'F' THEN 
    CONCAT(CONCAT(CONCAT(REPLACE(first_name,'a', '*****'), ' '), UPPER(last_name)), ' is in her 20s!') 
   
    
    WHEN TRUNC(age, -1) = 20 AND gender = 'M' THEN 
    CONCAT(CONCAT(CONCAT(REPLACE(first_name,'a', '*****'), ' '), UPPER(last_name)), ' is in his 20s!')
   
    
     WHEN TRUNC(age, -1) = 30 AND gender = 'F' THEN 
    CONCAT(CONCAT(CONCAT(REPLACE(first_name, 'a', '*****'), ' '), UPPER(last_name)), ' is in her 30s!')
   
    
     WHEN TRUNC(age, -1) = 30 AND gender = 'M' THEN 
    CONCAT(CONCAT(CONCAT(REPLACE(first_name, 'a', '*****'), ' '), UPPER(last_name)), ' is in his 30s!')
    
     WHEN TRUNC(age, -1) = 40 AND gender = 'F' THEN 
    CONCAT(CONCAT(CONCAT(REPLACE(first_name, 'a', '*****'), ' '), UPPER(last_name)), ' is in her prime 40s!')
    
     WHEN TRUNC(age, -1) = 40 AND gender = 'M' THEN 
    CONCAT(CONCAT(CONCAT(REPLACE(first_name, 'a', '*****'), ' '), UPPER(last_name)), ' is in his prime 40s!')
    
     WHEN age IS NULL THEN 
    CONCAT(CONCAT(CONCAT(REPLACE(first_name, 'a', '*****'), ' '), UPPER(last_name)), ' has no age on file!') 
    END AS "Employee Age Group"
FROM trainers

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('J*****son KING is in his prime 40s!',),
 ('Ben SCHROADER is in his 30s!',),
 ('S*****r*****h PINES is in her 30s!',),
 ('Leslie SIEBRACE is in her 30s!',),
 ('Jerry SIMPSON is in his 30s!',),
 ('Robert FROST is in his prime 40s!',),
 ('Vi JACOBSON is in his prime 40s!',),
 ('Steven JACOBSON is in his prime 40s!',),
 ('V*****ness***** WILLIAMS is in her prime 40s!',),
 ('Kirk MOORE has no age on file!',),
 ('Jennifer DUNN is in her 30s!',),
 ('W*****yne CAROLSON is in his 30s!',),
 ('Seth MORRISON has no age on file!',),
 ('Beth WATKINS is in her 20s!',),
 ('Courtney QUEEN is in her 30s!',),
 ('Doug ROBERTS is in his 30s!',),
 ('Drew SMILEY is in his prime 40s!',),
 ('S*****ndr***** DOWNS is in her 30s!',),
 ('Z*****ch DEJOUNG is in his prime 40s!',),
 ('Linsdey TUCKER is in her prime 40s!',),
 ('Tucker PETERSON is in his 20s!',),
 ('D*****ve HILL is in his 30s!',),
 ('Debbie TANG is in her 30s!',),
 ('Hunter FABEL is in his 20s!',),
 ('Peter DONNELLY is in his 30s!',),
 ('Steven HANSON is in his prime 40s!',),
 ('N*****th*****n STOKES is in his 20s!',),
 ('Log*****n GARO is in her 20s!',),
 ('L*****m*****r MADROVICH is in his 30s!',),
 ('L*****ur***** LEDLOW is in her prime 40s!',),
 ('Donnelly MILLER is in his prime 40s!',),
 ('Byron HOWARD is in his 20s!',),
 ('H*****nn***** WHITE is in her prime 40s!',),
 ('Wesley CORRALES is in his 20s!',),
 ('How*****rd LOWELSKI is in his 20s!',)]

This concludes this session on nested single-row functions. I have printed every record from each of the tables used in the above queries as a means for reference.

In [53]:
%sql SELECT * FROM emps

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[(100, 'Steven', 'King', 'SKING', '515.123.4567', datetime.datetime(2003, 6, 17, 0, 0), 'AD_PRES', Decimal('24000'), None, None, 90),
 (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', datetime.datetime(2005, 9, 21, 0, 0), 'AD_VP', Decimal('17000'), None, 100, 90),
 (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', datetime.datetime(2001, 1, 13, 0, 0), 'AD_VP', Decimal('17000'), None, 100, 90),
 (103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', datetime.datetime(2006, 1, 3, 0, 0), 'IT_PROG', Decimal('9000'), None, 102, 60),
 (104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', datetime.datetime(2007, 5, 21, 0, 0), 'IT_PROG', Decimal('6000'), None, 103, 60),
 (105, 'David', 'Austin', 'DAUSTIN', '590.423.4569', datetime.datetime(2005, 6, 25, 0, 0), 'IT_PROG', Decimal('4800'), None, 103, 60),
 (106, 'Valli', 'Pataballa', 'VPATABAL', '590.423.4560', datetime.datetime(2006, 2, 5, 0, 0), 'IT_PROG', Decimal('4800'), None, 103, 60),
 (107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', datetime.datetime(2007, 2, 7, 0, 0), 'IT_PROG', Decimal('4200'), None, 103, 60),
 (108, 'Nancy', 'Greenberg', 'NGREENBE', '515.124.4569', datetime.datetime(2002, 8, 17, 0, 0), 'FI_MGR', Decimal('12008'), None, 101, 100),
 (109, 'Daniel', 'Faviet', 'DFAVIET', '515.124.4169', datetime.datetime(2002, 8, 16, 0, 0), 'FI_ACCOUNT', Decimal('9000'), None, 108, 100),
 (110, 'John', 'Chen', 'JCHEN', '515.124.4269', datetime.datetime(2005, 9, 28, 0, 0), 'FI_ACCOUNT', Decimal('8200'), None, 108, 100),
 (111, 'Ismael', 'Sciarra', 'ISCIARRA', '515.124.4369', datetime.datetime(2005, 9, 30, 0, 0), 'FI_ACCOUNT', Decimal('7700'), None, 108, 100),
 (112, 'Jose Manuel', 'Urman', 'JMURMAN', '515.124.4469', datetime.datetime(2006, 3, 7, 0, 0), 'FI_ACCOUNT', Decimal('7800'), None, 108, 100),
 (113, 'Luis', 'Popp', 'LPOPP', '515.124.4567', datetime.datetime(2007, 12, 7, 0, 0), 'FI_ACCOUNT', Decimal('6900'), None, 108, 100),
 (114, 'Den', 'Raphaely', 'DRAPHEAL', '515.127.4561', datetime.datetime(2002, 12, 7, 0, 0), 'PU_MAN', Decimal('11000'), None, 100, 30),
 (115, 'Alexander', 'Khoo', 'AKHOO', '515.127.4562', datetime.datetime(2003, 5, 18, 0, 0), 'PU_CLERK', Decimal('3100'), None, 114, 30),
 (116, 'Shelli', 'Baida', 'SBAIDA', '515.127.4563', datetime.datetime(2005, 12, 24, 0, 0), 'PU_CLERK', Decimal('2900'), None, 114, 30),
 (117, 'Sigal', 'Tobias', 'STOBIAS', '515.127.4564', datetime.datetime(2005, 7, 24, 0, 0), 'PU_CLERK', Decimal('2800'), None, 114, 30),
 (118, 'Guy', 'Himuro', 'GHIMURO', '515.127.4565', datetime.datetime(2006, 11, 15, 0, 0), 'PU_CLERK', Decimal('2600'), None, 114, 30),
 (119, 'Karen', 'Colmenares', 'KCOLMENA', '515.127.4566', datetime.datetime(2007, 8, 10, 0, 0), 'PU_CLERK', Decimal('2500'), None, 114, 30),
 (120, 'Matthew', 'Weiss', 'MWEISS', '650.123.1234', datetime.datetime(2004, 7, 18, 0, 0), 'ST_MAN', Decimal('8000'), None, 100, 50),
 (121, 'Adam', 'Fripp', 'AFRIPP', '650.123.2234', datetime.datetime(2005, 4, 10, 0, 0), 'ST_MAN', Decimal('8200'), None, 100, 50),
 (122, 'Payam', 'Kaufling', 'PKAUFLIN', '650.123.3234', datetime.datetime(2003, 5, 1, 0, 0), 'ST_MAN', Decimal('7900'), None, 100, 50),
 (123, 'Shanta', 'Vollman', 'SVOLLMAN', '650.123.4234', datetime.datetime(2005, 10, 10, 0, 0), 'ST_MAN', Decimal('6500'), None, 100, 50),
 (124, 'Kevin', 'Mourgos', 'KMOURGOS', '650.123.5234', datetime.datetime(2007, 11, 16, 0, 0), 'ST_MAN', Decimal('5800'), None, 100, 50),
 (125, 'Julia', 'Nayer', 'JNAYER', '650.124.1214', datetime.datetime(2005, 7, 16, 0, 0), 'ST_CLERK', Decimal('3200'), None, 120, 50),
 (126, 'Irene', 'Mikkilineni', 'IMIKKILI', '650.124.1224', datetime.datetime(2006, 9, 28, 0, 0), 'ST_CLERK', Decimal('2700'), None, 120, 50),
 (127, 'James', 'Landry', 'JLANDRY', '650.124.1334', datetime.datetime(2007, 1, 14, 0, 0), 'ST_CLERK', Decimal('2400'), None, 120, 50),
 (128, 'Steven', 'Markle', 'SMARKLE', '650.124.1434', datetime.datetime(2008, 3, 8, 0, 0), 'ST_CLERK', Decimal('2200'), None, 120, 50),
 (129, 'Laura', 'Bissot', 'LBISSOT', '650.124.5234', datetime.datetime(2005, 8, 20, 0, 0), 'ST_CLERK', Decimal('3300'), None, 121, 50),
 (130, 'Mozhe', 'Atkinson', 'MATKINSO', '650.124.6234', datetime.datetime(2005, 10, 30, 0, 0), 'ST_CLERK', Decimal('2800'), None, 121, 50),
 (131, 'James', 'Marlow', 'JAMRLOW', '650.124.7234', datetime.datetime(2005, 2, 16, 0, 0), 'ST_CLERK', Decimal('2500'), None, 121, 50),
 (132, 'TJ', 'Olson', 'TJOLSON', '650.124.8234', datetime.datetime(2007, 4, 10, 0, 0), 'ST_CLERK', Decimal('2100'), None, 121, 50),
 (133, 'Jason', 'Mallin', 'JMALLIN', '650.127.1934', datetime.datetime(2004, 6, 14, 0, 0), 'ST_CLERK', Decimal('3300'), None, 122, 50),
 (134, 'Michael', 'Rogers', 'MROGERS', '650.127.1834', datetime.datetime(2006, 8, 26, 0, 0), 'ST_CLERK', Decimal('2900'), None, 122, 50),
 (135, 'Ki', 'Gee', 'KGEE', '650.127.1734', datetime.datetime(2007, 12, 12, 0, 0), 'ST_CLERK', Decimal('2400'), None, 122, 50),
 (136, 'Hazel', 'Philtanker', 'HPHILTAN', '650.127.1634', datetime.datetime(2008, 2, 6, 0, 0), 'ST_CLERK', Decimal('2200'), None, 122, 50),
 (137, 'Renske', 'Ladwig', 'RLADWIG', '650.121.1234', datetime.datetime(2003, 7, 14, 0, 0), 'ST_CLERK', Decimal('3600'), None, 123, 50),
 (138, 'Stephen', 'Stiles', 'SSTILES', '650.121.2034', datetime.datetime(2005, 10, 26, 0, 0), 'ST_CLERK', Decimal('3200'), None, 123, 50),
 (139, 'John', 'Seo', 'JSEO', '650.121.2019', datetime.datetime(2006, 2, 12, 0, 0), 'ST_CLERK', Decimal('2700'), None, 123, 50),
 (140, 'Joshua', 'Patel', 'JPATEL', '650.121.1834', datetime.datetime(2006, 4, 6, 0, 0), 'ST_CLERK', Decimal('2500'), None, 123, 50),
 (141, 'Trenna', 'Rajs', 'TRAJS', '650.121.8009', datetime.datetime(2003, 10, 17, 0, 0), 'ST_CLERK', Decimal('3500'), None, 124, 50),
 (142, 'Curtis', 'Davies', 'CDAVIES', '650.121.2994', datetime.datetime(2005, 1, 29, 0, 0), 'ST_CLERK', Decimal('3100'), None, 124, 50),
 (143, 'Randall', 'Matos', 'RMATOS', '650.121.2874', datetime.datetime(2006, 3, 15, 0, 0), 'ST_CLERK', Decimal('2600'), None, 124, 50),
 (144, 'Peter', 'Vargas', 'PVARGAS', '650.121.2004', datetime.datetime(2006, 7, 9, 0, 0), 'ST_CLERK', Decimal('2500'), None, 124, 50),
 (145, 'John', 'Russell', 'JRUSSEL', '011.44.1344.429268', datetime.datetime(2004, 10, 1, 0, 0), 'SA_MAN', Decimal('14000'), Decimal('0.4'), 100, 80),
 (146, 'Karen', 'Partners', 'KPARTNER', '011.44.1344.467268', datetime.datetime(2005, 1, 5, 0, 0), 'SA_MAN', Decimal('13500'), Decimal('0.3'), 100, 80),
 (147, 'Alberto', 'Errazuriz', 'AERRAZUR', '011.44.1344.429278', datetime.datetime(2005, 3, 10, 0, 0), 'SA_MAN', Decimal('12000'), Decimal('0.3'), 100, 80),
 (148, 'Gerald', 'Cambrault', 'GCAMBRAU', '011.44.1344.619268', datetime.datetime(2007, 10, 15, 0, 0), 'SA_MAN', Decimal('11000'), Decimal('0.3'), 100, 80),
 (149, 'Eleni', 'Zlotkey', 'EZLOTKEY', '011.44.1344.429018', datetime.datetime(2008, 1, 29, 0, 0), 'SA_MAN', Decimal('10500'), Decimal('0.2'), 100, 80),
 (150, 'Peter', 'Tucker', 'PTUCKER', '011.44.1344.129268', datetime.datetime(2005, 1, 30, 0, 0), 'SA_REP', Decimal('10000'), Decimal('0.3'), 145, 80),
 (151, 'David', 'Bernstein', 'DBERNSTE', '011.44.1344.345268', datetime.datetime(2005, 3, 24, 0, 0), 'SA_REP', Decimal('9500'), Decimal('0.25'), 145, 80),
 (152, 'Peter', 'Hall', 'PHALL', '011.44.1344.478968', datetime.datetime(2005, 8, 20, 0, 0), 'SA_REP', Decimal('9000'), Decimal('0.25'), 145, 80),
 (153, 'Christopher', 'Olsen', 'COLSEN', '011.44.1344.498718', datetime.datetime(2006, 3, 30, 0, 0), 'SA_REP', Decimal('8000'), Decimal('0.2'), 145, 80),
 (154, 'Nanette', 'Cambrault', 'NCAMBRAU', '011.44.1344.987668', datetime.datetime(2006, 12, 9, 0, 0), 'SA_REP', Decimal('7500'), Decimal('0.2'), 145, 80),
 (155, 'Oliver', 'Tuvault', 'OTUVAULT', '011.44.1344.486508', datetime.datetime(2007, 11, 23, 0, 0), 'SA_REP', Decimal('7000'), Decimal('0.15'), 145, 80),
 (156, 'Janette', 'King', 'JKING', '011.44.1345.429268', datetime.datetime(2004, 1, 30, 0, 0), 'SA_REP', Decimal('10000'), Decimal('0.35'), 146, 80),
 (157, 'Patrick', 'Sully', 'PSULLY', '011.44.1345.929268', datetime.datetime(2004, 3, 4, 0, 0), 'SA_REP', Decimal('9500'), Decimal('0.35'), 146, 80),
 (158, 'Allan', 'McEwen', 'AMCEWEN', '011.44.1345.829268', datetime.datetime(2004, 8, 1, 0, 0), 'SA_REP', Decimal('9000'), Decimal('0.35'), 146, 80),
 (159, 'Lindsey', 'Smith', 'LSMITH', '011.44.1345.729268', datetime.datetime(2005, 3, 10, 0, 0), 'SA_REP', Decimal('8000'), Decimal('0.3'), 146, 80),
 (160, 'Louise', 'Doran', 'LDORAN', '011.44.1345.629268', datetime.datetime(2005, 12, 15, 0, 0), 'SA_REP', Decimal('7500'), Decimal('0.3'), 146, 80),
 (161, 'Sarath', 'Sewall', 'SSEWALL', '011.44.1345.529268', datetime.datetime(2006, 11, 3, 0, 0), 'SA_REP', Decimal('7000'), Decimal('0.25'), 146, 80),
 (162, 'Clara', 'Vishney', 'CVISHNEY', '011.44.1346.129268', datetime.datetime(2005, 11, 11, 0, 0), 'SA_REP', Decimal('10500'), Decimal('0.25'), 147, 80),
 (163, 'Danielle', 'Greene', 'DGREENE', '011.44.1346.229268', datetime.datetime(2007, 3, 19, 0, 0), 'SA_REP', Decimal('9500'), Decimal('0.15'), 147, 80),
 (164, 'Mattea', 'Marvins', 'MMARVINS', '011.44.1346.329268', datetime.datetime(2008, 1, 24, 0, 0), 'SA_REP', Decimal('7200'), Decimal('0.1'), 147, 80),
 (165, 'David', 'Lee', 'DLEE', '011.44.1346.529268', datetime.datetime(2008, 2, 23, 0, 0), 'SA_REP', Decimal('6800'), Decimal('0.1'), 147, 80),
 (166, 'Sundar', 'Ande', 'SANDE', '011.44.1346.629268', datetime.datetime(2008, 3, 24, 0, 0), 'SA_REP', Decimal('6400'), Decimal('0.1'), 147, 80),
 (167, 'Amit', 'Banda', 'ABANDA', '011.44.1346.729268', datetime.datetime(2008, 4, 21, 0, 0), 'SA_REP', Decimal('6200'), Decimal('0.1'), 147, 80),
 (168, 'Lisa', 'Ozer', 'LOZER', '011.44.1343.929268', datetime.datetime(2005, 3, 11, 0, 0), 'SA_REP', Decimal('11500'), Decimal('0.25'), 148, 80),
 (169, 'Harrison', 'Bloom', 'HBLOOM', '011.44.1343.829268', datetime.datetime(2006, 3, 23, 0, 0), 'SA_REP', Decimal('10000'), Decimal('0.2'), 148, 80),
 (170, 'Tayler', 'Fox', 'TFOX', '011.44.1343.729268', datetime.datetime(2006, 1, 24, 0, 0), 'SA_REP', Decimal('9600'), Decimal('0.2'), 148, 80),
 (171, 'William', 'Smith', 'WSMITH', '011.44.1343.629268', datetime.datetime(2007, 2, 23, 0, 0), 'SA_REP', Decimal('7400'), Decimal('0.15'), 148, 80),
 (172, 'Elizabeth', 'Bates', 'EBATES', '011.44.1343.529268', datetime.datetime(2007, 3, 24, 0, 0), 'SA_REP', Decimal('7300'), Decimal('0.15'), 148, 80),
 (173, 'Sundita', 'Kumar', 'SKUMAR', '011.44.1343.329268', datetime.datetime(2008, 4, 21, 0, 0), 'SA_REP', Decimal('6100'), Decimal('0.1'), 148, 80),
 (174, 'Ellen', 'Abel', 'EABEL', '011.44.1644.429267', datetime.datetime(2004, 5, 11, 0, 0), 'SA_REP', Decimal('11000'), Decimal('0.3'), 149, 80),
 (175, 'Alyssa', 'Hutton', 'AHUTTON', '011.44.1644.429266', datetime.datetime(2005, 3, 19, 0, 0), 'SA_REP', Decimal('8800'), Decimal('0.25'), 149, 80),
 (176, 'Jonathon', 'Taylor', 'JTAYLOR', '011.44.1644.429265', datetime.datetime(2006, 3, 24, 0, 0), 'SA_REP', Decimal('8600'), Decimal('0.2'), 149, 80),
 (177, 'Jack', 'Livingston', 'JLIVINGS', '011.44.1644.429264', datetime.datetime(2006, 4, 23, 0, 0), 'SA_REP', Decimal('8400'), Decimal('0.2'), 149, 80),
 (178, 'Kimberely', 'Grant', 'KGRANT', '011.44.1644.429263', datetime.datetime(2007, 5, 24, 0, 0), 'SA_REP', Decimal('7000'), Decimal('0.15'), 149, None),
 (179, 'Charles', 'Johnson', 'CJOHNSON', '011.44.1644.429262', datetime.datetime(2008, 1, 4, 0, 0), 'SA_REP', Decimal('6200'), Decimal('0.1'), 149, 80),
 (180, 'Winston', 'Taylor', 'WTAYLOR', '650.507.9876', datetime.datetime(2006, 1, 24, 0, 0), 'SH_CLERK', Decimal('3200'), None, 120, 50),
 (181, 'Jean', 'Fleaur', 'JFLEAUR', '650.507.9877', datetime.datetime(2006, 2, 23, 0, 0), 'SH_CLERK', Decimal('3100'), None, 120, 50),
 (182, 'Martha', 'Sullivan', 'MSULLIVA', '650.507.9878', datetime.datetime(2007, 6, 21, 0, 0), 'SH_CLERK', Decimal('2500'), None, 120, 50),
 (183, 'Girard', 'Geoni', 'GGEONI', '650.507.9879', datetime.datetime(2008, 2, 3, 0, 0), 'SH_CLERK', Decimal('2800'), None, 120, 50),
 (184, 'Nandita', 'Sarchand', 'NSARCHAN', '650.509.1876', datetime.datetime(2004, 1, 27, 0, 0), 'SH_CLERK', Decimal('4200'), None, 121, 50),
 (185, 'Alexis', 'Bull', 'ABULL', '650.509.2876', datetime.datetime(2005, 2, 20, 0, 0), 'SH_CLERK', Decimal('4100'), None, 121, 50),
 (186, 'Julia', 'Dellinger', 'JDELLING', '650.509.3876', datetime.datetime(2006, 6, 24, 0, 0), 'SH_CLERK', Decimal('3400'), None, 121, 50),
 (187, 'Anthony', 'Cabrio', 'ACABRIO', '650.509.4876', datetime.datetime(2007, 2, 7, 0, 0), 'SH_CLERK', Decimal('3000'), None, 121, 50),
 (188, 'Kelly', 'Chung', 'KCHUNG', '650.505.1876', datetime.datetime(2005, 6, 14, 0, 0), 'SH_CLERK', Decimal('3800'), None, 122, 50),
 (189, 'Jennifer', 'Dilly', 'JDILLY', '650.505.2876', datetime.datetime(2005, 8, 13, 0, 0), 'SH_CLERK', Decimal('3600'), None, 122, 50),
 (190, 'Timothy', 'Gates', 'TGATES', '650.505.3876', datetime.datetime(2006, 7, 11, 0, 0), 'SH_CLERK', Decimal('2900'), None, 122, 50),
 (191, 'Randall', 'Perkins', 'RPERKINS', '650.505.4876', datetime.datetime(2007, 12, 19, 0, 0), 'SH_CLERK', Decimal('2500'), None, 122, 50),
 (192, 'Sarah', 'Bell', 'SBELL', '650.501.1876', datetime.datetime(2004, 2, 4, 0, 0), 'SH_CLERK', Decimal('4000'), None, 123, 50),
 (193, 'Britney', 'Everett', 'BEVERETT', '650.501.2876', datetime.datetime(2005, 3, 3, 0, 0), 'SH_CLERK', Decimal('3900'), None, 123, 50),
 (194, 'Samuel', 'McCain', 'SMCCAIN', '650.501.3876', datetime.datetime(2006, 7, 1, 0, 0), 'SH_CLERK', Decimal('3200'), None, 123, 50),
 (195, 'Vance', 'Jones', 'VJONES', '650.501.4876', datetime.datetime(2007, 3, 17, 0, 0), 'SH_CLERK', Decimal('2800'), None, 123, 50),
 (196, 'Alana', 'Walsh', 'AWALSH', '650.507.9811', datetime.datetime(2006, 4, 24, 0, 0), 'SH_CLERK', Decimal('3100'), None, 124, 50),
 (197, 'Kevin', 'Feeney', 'KFEENEY', '650.507.9822', datetime.datetime(2006, 5, 23, 0, 0), 'SH_CLERK', Decimal('3000'), None, 124, 50),
 (198, 'Donald', 'OConnell', 'DOCONNEL', '650.507.9833', datetime.datetime(2007, 6, 21, 0, 0), 'SH_CLERK', Decimal('2600'), None, 124, 50),
 (199, 'Douglas', 'Grant', 'DGRANT', '650.507.9844', datetime.datetime(2008, 1, 13, 0, 0), 'SH_CLERK', Decimal('2600'), None, 124, 50),
 (200, 'Jennifer', 'Whalen', 'JWHALEN', '515.123.4444', datetime.datetime(2003, 9, 17, 0, 0), 'AD_ASST', Decimal('4400'), None, 101, 10),
 (201, 'Michael', 'Hartstein', 'MHARTSTE', '515.123.5555', datetime.datetime(2004, 2, 17, 0, 0), 'MK_MAN', Decimal('13000'), None, 100, 20),
 (202, 'Pat', 'Fay', 'PFAY', '603.123.6666', datetime.datetime(2005, 8, 17, 0, 0), 'MK_REP', Decimal('6000'), None, 201, 20),
 (203, 'Susan', 'Mavris', 'SMAVRIS', '515.123.7777', datetime.datetime(2002, 6, 7, 0, 0), 'HR_REP', Decimal('6500'), None, 101, 40),
 (204, 'Hermann', 'Baer', 'HBAER', '515.123.8888', datetime.datetime(2002, 6, 7, 0, 0), 'PR_REP', Decimal('10000'), None, 101, 70),
 (205, 'Shelley', 'Higgins', 'SHIGGINS', '515.123.8080', datetime.datetime(2002, 6, 7, 0, 0), 'AC_MGR', Decimal('12008'), None, 101, 110),
 (206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', datetime.datetime(2002, 6, 7, 0, 0), 'AC_ACCOUNT', Decimal('8300'), None, 205, 110),
 (207, 'Sharon', 'Anderson', 'SANDERSON', '123.457.7890', datetime.datetime(2020, 12, 3, 21, 33, 19), 'AC_MGR', Decimal('10000'), None, 101, 110)]

In [54]:
%sql SELECT * FROM depts

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[(10, 'Administration', 200, 1700),
 (20, 'Marketing', 201, 1800),
 (30, 'Purchasing', 114, 1700),
 (40, 'Human Resources', 203, 2400),
 (50, 'Shipping', 121, 1500),
 (60, 'IT', 103, 1400),
 (70, 'Public Relations', 204, 2700),
 (80, 'Sales', 145, 2500),
 (90, 'Executive', 100, 1700),
 (100, 'Finance', 108, 1700),
 (110, 'Accounting', 205, 1700),
 (120, 'Treasury', None, 1700),
 (130, 'Corporate Tax', None, 1700),
 (140, 'Control And Credit', None, 1700),
 (150, 'Shareholder Services', None, 1700),
 (160, 'Benefits', None, 1700),
 (170, 'Manufacturing', None, 1700),
 (180, 'Construction', None, 1700),
 (190, 'Contracting', None, 1700),
 (200, 'Operations', None, 1700),
 (210, 'IT Support', None, 1700),
 (220, 'NOC', None, 1700),
 (230, 'IT Helpdesk', None, 1700),
 (240, 'Government Sales', None, 1700),
 (250, 'Retail Sales', None, 1700),
 (260, 'Recruiting', None, 1700),
 (270, 'Payroll', None, 1700),
 (280, 'It Training', 103, 1400),
 (290, 'User Training', 103, 1400),
 (300, 'Research and Development', None, 1700),
 (320, 'Engineering', None, 2500),
 (330, 'Facilities', None, 2500)]

In [55]:
%sql SELECT * FROM hr.jobs

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[('AD_PRES', 'President', 20080, 40000),
 ('AD_VP', 'Administration Vice President', 15000, 30000),
 ('AD_ASST', 'Administration Assistant', 3000, 6000),
 ('FI_MGR', 'Finance Manager', 8200, 16000),
 ('FI_ACCOUNT', 'Accountant', 4200, 9000),
 ('AC_MGR', 'Accounting Manager', 8200, 16000),
 ('AC_ACCOUNT', 'Public Accountant', 4200, 9000),
 ('SA_MAN', 'Sales Manager', 10000, 20080),
 ('SA_REP', 'Sales Representative', 6000, 12008),
 ('PU_MAN', 'Purchasing Manager', 8000, 15000),
 ('PU_CLERK', 'Purchasing Clerk', 2500, 5500),
 ('ST_MAN', 'Stock Manager', 5500, 8500),
 ('ST_CLERK', 'Stock Clerk', 2008, 5000),
 ('SH_CLERK', 'Shipping Clerk', 2500, 5500),
 ('IT_PROG', 'Programmer', 4000, 10000),
 ('MK_MAN', 'Marketing Manager', 9000, 15000),
 ('MK_REP', 'Marketing Representative', 4000, 9000),
 ('HR_REP', 'Human Resources Representative', 4000, 9000),
 ('PR_REP', 'Public Relations Representative', 4500, 10500)]

In [56]:
%sql SELECT * FROM trainers

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[(100, 'Jason', 'King', 41, 'M', datetime.datetime(2021, 1, 13, 23, 28, 29), None, 10, 10500, None),
 (110, 'Ben', 'Schroader', 37, 'M', datetime.datetime(2021, 1, 13, 23, 28, 29), 105, 20, 7601, None),
 (120, 'Sarah', 'Pines', 31, 'F', datetime.datetime(2021, 1, 13, 23, 28, 29), 160, 300, 3300, Decimal('0.18')),
 (130, 'Leslie', 'Siebrace', 31, 'F', datetime.datetime(2021, 1, 13, 23, 28, 29), 180, 400, 4600, Decimal('0.3')),
 (140, 'Jerry', 'Simpson', 34, 'M', datetime.datetime(2021, 1, 13, 23, 28, 29), 180, 400, 4401, Decimal('0.3')),
 (150, 'Robert', 'Frost', 47, 'M', datetime.datetime(2021, 1, 13, 23, 28, 29), 180, 400, 5700, Decimal('0.3')),
 (160, 'Vi', 'Jacobson', 47, 'M', datetime.datetime(2021, 1, 13, 23, 28, 29), 110, 30, 6801, Decimal('0.1')),
 (170, 'Steven', 'Jacobson', 44, 'M', datetime.datetime(2021, 1, 13, 23, 28, 29), 180, 400, 4400, Decimal('0.3')),
 (180, 'Vanessa', 'Williams', 40, 'F', datetime.datetime(2021, 1, 13, 23, 28, 29), 110, 40, 7100, Decimal('0.4')),
 (190, 'Kirk', 'Moore', None, 'M', datetime.datetime(2021, 1, 13, 23, 28, 29), 180, 400, 6900, Decimal('0.3')),
 (200, 'Jennifer', 'Dunn', 37, 'F', datetime.datetime(2021, 1, 13, 23, 28, 29), None, None, None, None),
 (210, 'Wayne', 'Carolson', 39, 'M', datetime.datetime(2021, 1, 13, 23, 28, 29), 160, 300, 4400, Decimal('0.18')),
 (220, 'Seth', 'Morrison', None, 'M', datetime.datetime(2021, 1, 13, 23, 28, 29), 110, 200, 2300, None),
 (230, 'Beth', 'Watkins', 28, 'F', datetime.datetime(2021, 1, 13, 23, 28, 29), 110, 200, 2300, None),
 (105, 'Courtney', 'Queen', 39, 'F', datetime.datetime(2021, 1, 13, 21, 45, 46), None, 10, 10800, None),
 (240, 'Doug', 'Roberts', 38, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 100, 60, 10000, None),
 (250, 'Drew', 'Smiley', 48, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 100, 50, 7500, None),
 (260, 'Sandra', 'Downs', 37, 'F', datetime.datetime(2021, 1, 26, 23, 43, 34), 240, 600, 8200, None),
 (270, 'Zach', 'DeJoung', 45, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 250, 500, 3900, None),
 (280, 'Linsdey', 'Tucker', 40, 'F', datetime.datetime(2021, 1, 26, 23, 43, 34), 240, 620, 9100, None),
 (290, 'Tucker', 'Peterson', 29, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 250, 510, 2500, None),
 (300, 'Dave', 'Hill', 37, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 160, 300, 4700, Decimal('0.13')),
 (310, 'Debbie', 'Tang', 31, 'F', datetime.datetime(2021, 1, 26, 23, 43, 34), 180, 400, 5500, Decimal('0.37')),
 (320, 'Hunter', 'Fabel', 20, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 110, 200, 2700, None),
 (330, 'Peter', 'Donnelly', 34, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 250, 500, 3800, None),
 (340, 'Steven', 'Hanson', 48, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 160, 300, 4100, Decimal('0.14')),
 (350, 'Nathan', 'Stokes', 27, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 240, 610, 8900, None),
 (360, 'Logan', 'Garo', 20, 'F', datetime.datetime(2021, 1, 26, 23, 43, 34), 110, 200, 2000, None),
 (370, 'Lamar', 'Madrovich', 39, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 250, 510, 2450, None),
 (380, 'Laura', 'Ledlow', 41, 'F', datetime.datetime(2021, 1, 26, 23, 43, 34), 240, 600, 7700, None),
 (390, 'Donnelly', 'Miller', 46, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 180, 400, 500, Decimal('0.27')),
 (400, 'Byron', 'Howard', 28, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 180, 400, 150, Decimal('0.24')),
 (410, 'Hanna', 'White', 44, 'F', datetime.datetime(2021, 1, 26, 23, 43, 34), 240, 610, 8900, None),
 (420, 'Wesley', 'Corrales', 29, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 110, 200, 2450, None),
 (430, 'Howard', 'Lowelski', 29, 'M', datetime.datetime(2021, 1, 26, 23, 43, 34), 250, 510, 2600, None)]

In [57]:
%sql SELECT * FROM occupations

 * oracle+cx_oracle://SYSTEM:***@localhost:1521/xe
0 rows affected.

[(10, 'OWNER', None, None, None, None),
 (20, 'GENERAL MANAGER', 7000, 10000, 18000, 'DR'),
 (30, 'SALES MANAGER', 4000, 6500, 9500, 'MA'),
 (40, 'FITNESS MANAGER', 5500, 7500, 10800, 'MS'),
 (50, 'FACILITIES MANAGER', 3500, 5000, 7000, 'BS'),
 (60, 'IT MANAGER', 7500, 10500, 15000, 'DR'),
 (200, 'CLERK', 2000, 3000, 4000, 'HS'),
 (300, 'SALES ASSOCIATE', 3000, 4500, 6000, 'BA'),
 (400, 'PERSONAL TRAINER', None, None, None, 'HS'),
 (500, 'MAINTENANCE', 3000, 4000, 5500, 'BA'),
 (510, 'JANITOR', 2200, 3000, 4000, 'HS'),
 (600, 'ANALYST', 5500, 8500, 14000, 'MS'),
 (610, 'SOFTWARE ENGINEER', 8000, 11500, 17000, 'MS'),
 (620, 'DBA', 6500, 12000, 15000, 'MS')]